README.org
#+TITLE:   pgronkievitz's configuration of /*DOOM*/
#+subtitle: Doom guy would be proud
#+startup: inlineimages nofold
#+language: en
#+author: Patryk Gronkiewicz
#+html_head: <link rel='shortcut icon' type='image/png' href='https://www.gnu.org/software/emacs/favicon.png'>
#+property: header-args:elisp :exports code
#+embed: LICENSE :description MIT lincese file
#+startup: fold
#+latex_class: book
#+options: coverpage:yes

[[https://img.shields.io/badge/Emacs-DOOM-blueviolet.svg?logo=gnuemacs&style=flat-square]][[https://img.shields.io/badge/unstable-blue.svg?logo=nixos&logoColor=white&label=NixOS&style=flat-square]]
#+begin_quote
Talk is cheap - show me the code --- Linus Torvalds
#+end_quote

* Introduction
Behold newcomers! This configuration is made by a total elisp noob and comes with no warranty to work. Those configurations might be broken in some places, but with mitigation on NixOS's side. Please refer to [[https://gitlab.com/pgronkievitz/nixos-configurations][my system configuration]] before reaching out.

This configuration is strongly inspired by [[https://tecosaur.github.io/emacs-config/config.html][TEC's config]], but as everyone can see --- it's not as extensive (yet).
* Misc
** Completions
Vertico & Company is best of its kind match for me, but I can't wait for Cape implementation in Doom.
#+name: completion
#+begin_src elisp :noweb yes
:completion
    (company
    +childframe)
    (vertico +icons)
#+end_src
** Doom features
Just basic packages for helper functions, dashboard and preventing me from leaving.
#+name: doomfeatui
#+begin_src elisp
doom                ; what makes DOOM look the way it does
doom-dashboard      ; a nifty splash screen for Emacs
doom-quit           ; DOOM quit-message prompts when you quit Emacs
#+end_src
** Dev features
As all things should be - fill column and indent guides are lifesavers when writing in Python.
#+name: devfeatui
#+begin_src elisp
fill-column
indent-guides       ; highlighted indent columns
vc-gutter           ; vcs diff in the fringe
#+end_src
** Visual nicities
#+name: nicevisui
#+begin_src elisp :noweb yes :exports none
<<nicecode>>
<<vimificationvis>>
<<othervis>>
#+end_src
OOH, SHINY!
#+name: nicecode
#+begin_src elisp
hl-todo             ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
(ligatures +extra)  ; ligatures and symbols to make your code pretty again
#+end_src
I feel like it's more vim-thing, but I still like it.
#+name: vimificationvis
#+begin_src elisp
vi-tilde-fringe     ; fringe tildes to mark beyond EOB
(modeline +light)            ; snazzy, Atom-inspired modeline, plus API
#+end_src
Give that man some smileys!
#+name: othervis
#+begin_src elisp
(emoji +github +unicode)
ophints             ; highlight the region an operation acts on
(popup +all)        ; tame sudden yet inevitable temporary windows
zen                 ; distraction-free coding or writing
#+end_src
** Making DOOM a proper IDE
I don't use treemacs much, but it's nice for checking project structure.
#+name: ideui
#+begin_src elisp
(treemacs +lsp)              ; a project drawer, like neotree but cooler
#+end_src
** Ergonomics
#+name: ergonomicsui
#+begin_src elisp
(window-select +numbers)     ; visually switch windows
workspaces          ; tab emulation, persistence & separate workspaces
#+end_src
Make my pinkies +suffer+ happy
#+name: ergonomicseditor
#+begin_src elisp
(evil +everywhere)       ; come to the dark side, we have cookies
#+end_src
** UI
#+name: ui
#+begin_src elisp :noweb yes
:ui
    <<doomfeatui>>
    <<nicevisui>>
    <<devfeatui>>
    <<ideui>>
    <<ergonomicsui>>
#+end_src
** Editor
#+name: editor
#+begin_src elisp :noweb yes
:editor
    <<ergonomicseditor>>
    file-templates      ; auto-snippets for empty files
    fold                ; (nigh) universal code folding
    (format
    +onsave)           ; automated prettiness
    rotate-text       ; cycle region at point between text candidates
    snippets            ; my elves. They type so I don't have to
    word-wrap           ; soft wrapping with language-aware indent
#+end_src
** Emacs
#+name: emacs
#+begin_src elisp
:emacs
    (dired
    +icons
    +ranger)         ; making dired pretty [functional]
    electric          ; smarter, keyword-based electric-indent
    (ibuffer +icons)         ; interactive buffer management
    (undo
    +tree)           ; persistent, smarter undo for your inevitable mistakes
    vc                ; version-control and Emacs, sitting in a tree
#+end_src
** Terminal
Who needs anything else?
#+name: terminal
#+begin_src elisp
:term
    vterm               ; the best terminal emulation in Emacs
#+end_src
** Checking
Yuo cen't bee rong
#+name: checkers
#+begin_src elisp
:checkers
    (syntax +childframe)     ; tasing you for every semicolon you forget
    (spell +flyspell +hunspell)        ; tasing you for misspelling mispelling
    grammar           ; tasing grammar mistake every you make
#+end_src
** Tools
#+name: tools
#+begin_src elisp
:tools
    ;;ansible
    biblio
    debugger          ; FIXME stepping through code, to help you add bugs
    direnv
    (docker +lsp)
    editorconfig        ; let someone else argue about tabs vs spaces
    ein                 ; tame Jupyter notebooks with emacs
    (eval +overlay)     ; run code, run (also, repls)
    (lookup
    +offline
    +dictionary
    +docsets)           ; navigate your code and its documentation
    (lsp +peek)
    (magit
    +forge)            ; a git porcelain for Emacs
    make                ; run make tasks from Emacs
    pdf                 ; pdf enhancements
    rgb                 ; creating color strings
    terraform         ; infrastructure as code
    upload              ; map local to remote projects via ssh/ftp
#+end_src
** OS
#+name: os
#+begin_src elisp
:os
    tty               ; improve the terminal Emacs experience
#+end_src
** Languages
#+name: languages
#+begin_src elisp
:lang
    beancount         ; mind the GAAP
    ;;(cc
    ;; +lsp)               ; C > C++ == 1
    (csharp +lsp +dotnet)            ; unity, .NET, and mono shenanigans
    data                ; config/data formats
    emacs-lisp          ; drown in parentheses
    (ess +lsp)               ; emacs speaks statistics
    (go +lsp)         ; the hipster dialect
    (json
    +lsp)              ; At least it ain't XML
    ;;javascript        ; all(hope(abandon(ye(who(enter(here))))))
    (latex
    +latexmk
    +cdlatex)           ; writing papers in Emacs has never been so fun
    (lua +lsp)               ; one-based indices? one-based indices
    (markdown)
    nix                 ; I hereby declare "nix geht mehr!"
    (org
    +dragndrop
    +gnuplot
    +pandoc
    +pomodoro
    +present
    +pretty
    +hugo
    +noter
    +roam2)              ; organize your plain life in plain text
    plantuml            ; diagrams for confusing people more
    (python
    +lsp
    +pyright)             ; beautiful is better than ugly
    rest              ; Emacs as a REST client
    rst               ; ReST in peace
    ;;(rust
    ;;+lsp)              ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
    sh                ; she sells {ba,z,fi}sh shells on the C xor
    web               ; the tubes
    (yaml
    +lsp)              ; JSON, but readable
#+end_src
** Email
#+name: email
#+begin_src elisp
:email
    (mu4e +org)
#+end_src
** App
#+name: app
#+begin_src elisp
:app
    calendar
    irc               ; how neckbeards socialize
    rss        ; emacs as an RSS reader
#+end_src
** Config
#+name: config
#+begin_src elisp
:config
    (default +bindings +smartparens)
#+end_src
* ~init.el~ file
#+begin_src elisp :tangle init.el :noweb yes
(doom!
       <<completion>>
       <<ui>>
       <<editor>>
       <<emacs>>
       <<terminal>>
       <<checkers>>
       <<tools>>
       <<os>>
       <<languages>>
       <<email>>
       <<app>>
       <<config>>
)
#+end_src

* Packages
#+begin_src elisp :tangle packages.el :noweb yes
<<orgpkgs>>
<<protopkgs>>
<<writingpkgs>>
<<themingpkgs>>
#+end_src
** Org packages
#+name: orgpkgs
#+begin_src elisp
(package! org-super-agenda)
(package! org-pretty-table :recipe (:host github :repo "Fuco1/org-pretty-table"))
(package! org-fragtog)
(package! org-appear :recipe (:host github :repo "awth13/org-appear"))
(package! org-pretty-tags)
(package! org-ol-tree :recipe (:host github :repo "Townk/org-ol-tree"))
(package! laas :recipe (:host github :repo "tecosaur/LaTeX-auto-activating-snippets"))
(package! org-roam-ui :recipe (:host github :repo "org-roam/org-roam-ui" :files ("*.el" "out")))
(package! websocket)
(package! org-alert :recipe (:host github :repo "spegoraro/org-alert" :files ("*.el")))
(package! org-notifications :recipe (:host github :repo "doppelc/org-notifications" :files ("*.el" "sounds")))
(package! pretty-agenda :recipe (:host github :repo "Artawower/.doom" :files ("pretty-agenda.el")))
(package! doct :recipe (:host github :repo "progfolio/doct"))
(package! screenshot :recipe (:host github :repo "tecosaur/screenshot"))
#+end_src
** Ye olde internet
#+name: protopkgs
#+begin_src elisp
(package! elpher)
(package! elfeed-protocol)
#+end_src
** Writing in general
#+name: writingpkgs
#+begin_src elisp
(package! guess-language)
#+end_src
** Theming
#+name: themingpkgs
#+begin_src elisp
(unpin! doom-themes)
#+end_src
